<?php

use Illuminate\Database\Seeder;

class BlogSeeder extends Seeder
{
    /**
     * Run the database seeds.
     *
     * @return void
     */
    public function run()
    {
        \App\Blog::create([
            'blog_title' => "লাভজনক পদ্ধতিতে মাছ চাষ",
            'blog_details' => "মাছ আমাদের প্রাণিজ আমিষের অন্যতম উৎস। কর্মসংস্থান, বৈদেশিক মুদ্রা উপার্জন এবং পুষ্টি সরবরাহে মাছের উল্লেখযোগ্য ভূমিকা রয়েছে। একই পুকুরে নানা জাতের মাছ চাষ করা যায়, খাল ও ডোবায় মাছ চাষ করা যায়, আবার চৌবাচ্চায়, খাঁচায় মাছের চাষ করা যায়। কোনো নির্দিষ্ট জলাশয়ে পরিকল্পিত উপায়ে স্বল্পপুঁজি, অল্পসময় ও লাগসই প্রযুক্তির মাধ্যমে মাছের বিভিন্ন নিয়ম মেনে প্রাকৃতিক উৎপাদনের চেয়ে অধিক মাছ উৎপাদনই মাছ চাষ। মাছ চাষে লাভবান হতে হলে মাছ চাষ পরিকল্পনা থেকে শুরু করে বাজারজাত করা পর্যন্ত প্রতিটি পর্বে মাছ চাষিকে বিশেষ কিছু নিয়মকানুন মেনে চলতে হয়। মাছ চাষির অজ্ঞতা বা অবহেলা বা ভুল লাভজনক মাছ চাষের ক্ষেত্রে অন্তরায়। আমাদের দৈনন্দিন খাদ্য তালিকায় মাছ হচ্ছে একটি গুরুত্বপূর্ণ উপাদান। মাছের অনেক চাহিদা থাকার কারণে মাছ চাষ করে ভালো আয় করা সম্ভব। স্থানীয় হাট, বাজার ছাড়াও দূরবর্তী বাজারে মাছ বিক্রি করে লাভ করা সম্ভব। তাছাড়া বিদেশে মাছ রফতানি করে প্রচুর বৈদেশিক মুদ্রা অর্জন করা সম্ভব। মাছ চাষে বাংলাদেশ এখন চতুর্থ। এটা আমাদের গর্বের বিষয়।
মাছের গুণাগুণ ও সুষ্ঠু পরিকল্পনা
আমাদের দেশের স্বাদু পানিতে ২৬০টিরও বেশি প্রজাতির মাছ আছে। এছাড়া খাঁড়ি অঞ্চলে ও লোনা পানিতে কয়েকশ‘ প্রজাতির মাছ আছে। তবে চাষযোগ্য মাছগুলো হলো রুই, কাতলা, মৃগেল, কালিবাউস, সিলভারকার্প, মিররকার্প, গ্রাসকার্প, কমনকার্প, বিগহেড, রাজপুঁটি, নাইলোটিকা, তেলাপিয়া, বিদেশি মাগুর, থাই পাঙ্গাশ এসব। এসব মাছের কিছু বিশেষ গুণাগুণ আছে। এসব মাছ খুব দ্রুত বাড়ে; খাদ্য ও জায়গার জন্য একে অন্যের সঙ্গে প্রতিযোগিতা করে না; পুকুরে  বেশি সংখ্যায় চাষ করা যায়; পানির সব স্তর থেকে খাবার গ্রহণ করে, পুকুরের পরিবেশ ভালো থাকে; খেতে খুব সুস্বাদু; বাজারে এসব মাছের প্রচুর চাহিদা আছে; সহজে রোগাক্রান্ত হয় না, চাষে লাভ বেশি হয়। এজন্য লাভজনকভাবে এসব মাছে চাষ করা যায় আনয়াসে। মাছ চাষ শুরু করার আগে প্রয়োজন হচ্ছে সঠিক সুষ্ঠু এবং বিজ্ঞানসম্মত পরিকল্পনা।
মাছ উৎপাদন কৌশল
১. সনাতন পদ্ধতির মাছ চাষ : এ পদ্ধতিতে পুকুরের কোনো ব্যবস্থাপনা ছাড়াই মাটি ও পানির উর্বরতায় পানিতে যে প্রাকৃতিক খাদ্য তৈরি হয় মাছ তাই খেয়ে জীবন ধারণ করে। এক্ষেত্রে আলাদা কোনো পরিচর্যা নিতে হয় না;
 ২. আধানিবিড় পদ্ধতির মাছ চাষ : এ পদ্ধতিতে নিয়মমতো পুকুর প্রস্তুত করে আংশিক সার ও খাদ্য সরবরাহ করে মাছের খাদ্য উৎপন্ন করতে হয়। পুকুরের বিভিন্ন স্তরে উৎপাদিত খাদ্যের সঠিক ব্যবহারের দিকে লক্ষ্য রেখে মাছের পোনা ছাড়তে হয়;
 ৩. নিবিড় পদ্ধতির মাছ চাষ : অল্প জায়গায়, অল্প সময়ে বেশি উৎপাদনের জন্য সুপরিকল্পিতভাবে সার্বিক ব্যবস্থাপনা নিশ্চিত করে পুকুরে প্রাকৃতিক খাদ্যের উৎপাদন বাড়াতে হয়;
 ৪. কার্প জাতীয় মাছের মিশ্রচাষ : পুকুরের বিভিন্ন স্তরে উৎপন্ন খাবার সম্পূর্ণ ব্যবহার করার জন্য রুই, কাতলা, মৃগেল, কালিবাউস, বিগহেড, সিলভারকার্প, মিররকার্প, কমনকার্প, কারপিউ এসব নানা প্রজাতির মাছ একসাথে চাষ করা যায়।
পুকুর নির্বাচন
১. পুকুরটি খোলামেলা  রোদ্রউজ্জ্বল জায়গায় এবং বাড়ির আশপাশে হতে হবে যেন নিরাপত্তা নিশ্চিত করা যায়;
২. মাটির গুণাগুণ পুকুরের জন্য খুব গুরুত্বপূর্ণ। সাধারণত দো-আঁশ, এঁটেল দো-আঁশ ও এঁটেল মাটি পুকুরের জন্য ভালো;
৩. পুকুরের আয়তন কমপক্ষে ১০ শতাংশ হতে হবে। ৩০ শতাংশ থেকে ৫০ শতাংশ আকারের পুকুর মাছ চাষের জন্য বেশি উপযোগী;
৪. পুকুরের গভীরতা ২-৩ মিটার রাখতে হবে এবং বছরের পুরো সময় পানি থাকতে হবে;
৫. পুকুর পাড়ে বড় গাছ বা ঝোপঝাড় থাকা যাবে না। বিশেষ করে পাতাঝরা গাছ রাখা যাবে না।",
            'featured_image' => "1.jpg",
            'publish_status' => true,
            'blog_category_id' => 1,
            'blogger_id' => 1,
        ]);
        \App\Blog::create([
            'blog_title' => "ব্ল্যাক বেঙ্গল ছাগল পালন",
            'blog_details' => "ক্রমবর্ধমান জনসংখ্যার সাথে তালমিলিয়ে দেশে পোলট্রি এবং মৎস্য উৎপাদন দ্রুত বাড়লেও প্রযুক্তিগত জ্ঞানের অভাবে প্রাণিসম্পদ বিশেষ করে ছাগলের উৎপাদন  তেমনটা আশানুরূপ বাড়েনি। এদেশে প্রাপ্ত প্রায় ২০ মিলিয়ন ছাগলের প্রায় ৯৩ শতাংশ পালন করে ক্ষুদ্র এবং মাঝারি ধরনের খামারিরা। অথচ গবাদি প্রাণিকুলের মধ্যে ছাগল পালন যতটা লাভজনক ও সহজ অন্যগুলো তেমন নয়। ছাগলের যেসব জাত আছে যেমন অ্যাংগোরা, বারবারি, বিটাল, যমুনাপারি, সুরতি, মারওয়ারি, মালবারি, গাড্ডি, কাশ্মিরী, পশমিনা, সানেন, টুগেনবার্গ, অরপাইন, মোহসানা, ফিজি, অ্যাংলোলু। এসবের মধ্যে বাংলাদেশের ব্ল্যাক বেঙ্গল বিশ্বমানের বিশ্ব সেরা। এসব ব্ল্যাক বেঙ্গল ছাগলের মাংস যেমন সুস্বাদু, চামড়া তেমনি আন্তর্জাতিকভাবে উন্নতমানের বলে স্বীকৃত। তাছাড়া ব্ল্যাক বেঙ্গল ছাগলের বাচ্চা উৎপাদন ক্ষমতা অধিক এবং তারা দেশীয় জলবায়ুতে বিশেষভাবে উৎপাদন উপযোগী। ব্ল্যাক বেঙ্গল ছাগল প্রধানত গোশত ও চামড়া উৎপাদনকারী জাত হিসেবে বিশ্বে স্বীকৃত। এজন্য আমরা খুব গর্ব করে বলতে পারি ব্ল্যাক বেঙ্গল আমাদের ছাগলের জাত। এদের গড় ওজন ১৫-২০ কেজি। কখনও কখনও ৩০-৩২ কেজি পর্যন্ত হয়।  দৈনিক ওজন বৃদ্ধির হার দৈনিক ২০-৪০ গ্রাম। নির্দিষ্ট পদ্ধতিতে ছাগল পালনের মাধ্যমে একজন ভূমিহীন বা প্রান্তিক খামারি বাড়তি আয় করতে পারেন। এমনও প্রমাণ আছে ব্ল্যাক বেঙ্গল ছাগল পালন করে অনেক আশাতীত সফলতা পেয়েছেন। সুতরাং ক্ষুদে মাঝারি কিংবা বড় খামারিদের জন্য ব্ল্যাক বেঙ্গল ছাগল পালন একটি নিশ্চিত লাভজনক কার্যক্রম।
ব্ল্যাক বেঙ্গল ছাগল বাংলাদেশ ছাড়া ভারতের পশ্চিম বাংলা, আসাম ও অন্যান্য রাজ্যে পাওয়া যায়। আকারে ছোট ও বড় দুই রকমের হয়। এজন্য বয়স্ক পুরুষ ও স্ত্রী ছাগলের ওজনের তারতম্য দেখা যায়। এদের ঘাড় এবং পেছনের অংশ উচ্চতায় প্রায় সমান থাকে। বুক প্রশস্ত। পাগুলো ছোট ছোট। ছাগ এবং ছাগীর শিং আছে। শিং ছোট বা মাঝারি আকারের হতে পারে। লম্বায় ৫-১০ সেন্টিমিটার হয়। শিং ওপরের দিক থেকে পেছনে বাঁকানো থাকে। কানের আকার ছোট ও মাঝারি কিছুটা ওপরের দিকে থাকে। দেহের গড়ন আঁটসাঁট। গায়ের রঙ সাধারণত কালো। তবে ধূসর সাদা বা বাদামি রঙেরও হতে পারে। গায়ের লোম ছোট ও মসৃণ। বছরে দুইবার এবং এক সাথে একাধিক বাচ্চা উৎপাদন করে। তবে দুধ উৎপাদন ক্ষমতা তুলনামূলক কম। স্ত্রী ছাগল ৯-১০ মাস বয়স হলেই প্রজননের যোগ্য হয় এবং ১৪-১৫ মাস বয়সে প্রথম বাচ্চা প্রসব করে। বলা যায়,  গোশতের জন্য ব্ল্যাক বেঙ্গল সর্বোৎকৃষ্ট। তবে দুধের জন্য যমুনাপারি, বারবারি ভালো। আর পশমের জন্য গাড্ডি ও অ্যাংগোরা ভালো।
ব্ল্যাক বেঙ্গল ছাগল পালনে সুবিধাদি-
০ পারিবারিক আয় বাড়ে;
০ আত্মকর্মসংস্থানের ব্যবস্থা হয়, পরিবারের গোশত ও দুধের চাহিদা মেটে;
০ পারিবারিক আমিষের চাহিদা পূরণ হয়;
০ চামড়া রফতানির মাধ্যমে অধিকতর আয় বাড়ে;
০ ছাগলের দুধ খুবই পুষ্টিকর এবং এলার্জি উপসর্গ উপশমকারী;
০ ব্ল্যাক বেঙ্গলের গোশত সুস্বাদু ও চামড়া আন্তর্জাতিকভাবে উন্নতমানের বলে স্বীকৃত;
০ অধিক বাচ্চা উৎপাদন ক্ষমতাসম্পন্ন এবং দেশীয় জলবায়ুতে বিশেষভাবে উৎপাদন উপযোগী;
০ ছাগল পালনে অল্প জায়গার প্রয়োজন হয়, পারিবারিক যে কোনো সদস্য দেখাশোনা করতে পারেন;
০ শয়ন ঘরে বা রান্না ঘরে কিংবা শয়ন ঘরের পাশে সাধারণ মানের কম খরচি ঘরে রাখা যায়;
০ দ্রুত বংশ বৃদ্ধি ঘটে বলে অল্প সময়ে সুফল পাওয়া যায়;
০ সব ধর্মালম্বী লোকদের জন্য ছাগলের গোশত সমাদৃত;
০ ছাগল পালনে অন্যান্য পশুর মতো আলাদ বিশেষ গোচারণভূমির প্রয়োজন হয় না;
০ ক্ষেতের আইলের, রাস্তার ধারে, বাড়ির আশপাশের অনাবাদি জায়গার ঘাস লতাপাতা খেয়ে জীবনধারণ করতে পারে;
০ বাড়ির আঙিনার আশপাশের গাছগাছড়ার লতাপাতা ছাগলের খাদ্য হিসেবে ব্যবহার করা যায়;
০ অল্প পুঁজিতে লালন পালন করা যায়;
০ গবাদিপশুর মতো উন্নতমানের খাদ্য আবাসন বা অন্যান্য বিশেষ যতেœর প্রয়োজন হয় না।",
            'featured_image' => "2.jpg",
            'publish_status' => true,
            'blog_category_id' => 2,
            'blogger_id' => 1,
        ]);
        \App\Blog::create([
            'blog_title' => "উন্নত জাতের গাভী পালন",
            'blog_details' => "পরিকল্পিতভাবে গাভী পালন একটা লাভজনক কার্যক্রম অল্প মাঝারি বেশি সব ধরনের পুঁজি দিয়ে সুষ্ঠুভাবে গাভী পালন করলে অনেক লাভবান হওয়া যায়।
গাভী পালনের জন্য ঘরটি মোটামুটি খোলামেলা জায়গায় হতে হবে; বাঁশ, ছন, খড়, পাটখড়ি দিয়ে ঘর নির্মাণ; ঘরের মেঝে ঢালু ও ড্রেনের ব্যবস্থা রাখতে হবে যাতে চোনা ও পানি গড়িয়ে বেরিয়ে যেতে পারে; খাদ্য ও পানির পাত্রগুলো প্রতিদিন নিয়মিত পরিষ্কার করা; খাওয়া শেষ হলে পাত্রগুলো ঢেকে রাখতে হবে। গরুকে নিয়মিত গোসল করাতে হবে; প্রতিদিন নিয়মিত গোয়াল ঘরের গোবর-চোনা পরিষ্কার করে নির্দিষ্ট স্থানে বা গর্তে জমা করতে হবে। যা পরবর্তীতে মূল্যবান সারে পরিণত হয়; গরুর গায়ের আঠালি, ডাসা (মাছি), জোঁক অবাঞ্ছিত পোকামাকড় বেছে ফেলতে হবে; গরুর স্বাস্থ্য নিয়মিত পরীক্ষা করিয়ে নিতে হবে; উপজেলা প্রাণিসম্পদ কার্যালয়  থেকে গবাদিপশুকে গোবসন্ত, তরকা, বাদলা, গলাফুলা, ক্ষুরা রোগের প্রতিষেধক টিকা দিতে হবে; গবাদিপশুর রোগ দেখা দিলে প্রাণিচিকিৎসক বা নিকটস্থ উপজেলা প্রাণিসম্পদ কার্যালয়ের সঙ্গে যোগাযোগ করতে হবে।


উন্নত জাতের গাভী প্রাপ্তি স্থান
মানিকগঞ্জ, যশোর, খুলনা, কুষ্টিয়া, ফরিদপুর, টাঙ্গাইল, সৈয়দপুর, ঠাকুরগাঁও, চিরিরবন্দর, রংপুর সদর, বগুড়া সদর, রাজশাহী সদর, ঢাকা সদর, নারায়ণগঞ্জ সদর, কুমিল্লা সদর, চট্টগ্রাম সদর, সলেট সদর, বাঘাবাড়ীঘাট মিল্কভিটা এলাকা, সাভার এলাকার মুশুরী খোলা, ভার্কুতা, কেরানীগঞ্জ উপজেলার আটি এলাকা উল্লেখযোগ্য।
পালনের জন্য দেশি উন্নত জাতের অথবা সংকর জাতের গাভী নির্বাচন করতে হবে।


দৈনিক সুষম খাদ্য-তালিকা (গ্রাম হিসেবে)
চালের গুঁড়া ২৫০; গমের ভুসি ২৫০; খৈল ২৫০; ডালের ভুসি ২৫০; চিটাগুড় ২০০; লবণ/খনিজ; মিশ্রণ ভিটামিনসহ ৫০ গ্রাম।
এছাড়াও দৈনিক অন্তত ৩ কেজি খড় অথবা ৯-১২ কেজি কাঁচা ঘাস ও প্রচুর পরিমাণে ঠাণ্ডা পরিষ্কার পানি খাওয়াতে হবে।


বাছুরের পরিচর্যা
চালের গুঁড়া ৩০০ গ্রাম; গমের ভুসি ৩০০ গ্রাম; খৈল ২৫০ গ্রাম; চিটাগুড় ১৫০ গ্রাম; লবণ ও ভিটামিন ৫০ গ্রাম।
এছাড়াও পর্যাপ্ত পরিমাণে খড়, কাঁচাঘাস ও বিশুদ্ধ ঠাণ্ডা পানি খাওয়াতে হবে। ছয় মাস বয়সে বাছুরকে সংক্রামক রোগের প্রতিষেধক টিকা দিতে হবে। বাছুরকে কৃমির ওষুধ চিকিৎসকের পরামর্শ মতে দিতে হবে। স্বাস্থ্যের প্রতি লক্ষ্য রেখে সুষম খাদ্য দিতে হবে।


প্রাথমিক প্রয়োজন : যে কোনো কিছু গড়তে সবার আগে প্রয়োজন প্রাথমিক প্রস্তুতি। এ প্রস্তুতির ওপর নির্ভর করে যে কোনো কাজের সফলতার ও ব্যর্থতা। ডেইরি ফার্ম গড়ে তুলতে প্রয়োজন আর্থিক সঙ্গতি, অভিজ্ঞতা ও গরুর নিরাপদ আশ্রয়। প্রথমেই বিশাল ফার্ম তৈরিতে হাত না দিয়ে ছোট পরিসরে কাজে হাত দেয়া ভালো। ৫ থেকে ৬টি গরু নিয়ে যাত্রা করে আস্তে আস্তে ফার্মকে সম্প্রসারণ করাই উত্তম। ২টি গরুর জন্য একজন দক্ষ লোক নিয়োগ করা গেলে ভালো। তবে খেয়াল রাখতে হবে লোকটির গরুর যত্ন নেয়ার পূর্ব অভিজ্ঞতা আছে কিনা।",
            'featured_image' => "3.jpg",
            'publish_status' => true,
            'blog_category_id' => 3,
            'blogger_id' => 1,
        ]);
        \App\Blog::create([
            'blog_title' => "বোরো মৌসুমে হাইব্রিড ধানের চাষ",
            'blog_details' => "বাংলাদেশে চাষযোগ্য জমি দিন দিন কমছে এবং লোকসংখ্যা বাড়ছে। ক্রমবর্ধমান জনসংখ্যার খাদ্য চাহিদা মেটাতে হাইব্রিড ধান চাষের বিকল্প নেই। উফশী জাতের তুলনায়  হাইব্রিড ধান চাষে ৩০-৪০% ফলন বৃদ্ধি হয়। তাই হাইব্রিড ধান চাষাবাদ সময়ের দাবি।


হাইব্রিড ধান উৎপাদন পদ্ধতি উফশী ধানচাষ পদ্ধতির মতোই; তবে হাইব্রিড ধানচাষের ক্ষেত্রে বীজতলার জন্য বিশেষ যত্নবান হওয়া প্রয়োজন। হাইব্রিড ধান চাষের উল্লেখযোগ্য দিক হলো।
হাইব্রিড ধানের জন্য প্রতি হেক্টরে মাত্র ২০ কেজি বীজ ব্যবহার করা হয়।

বীজতলার জমিতে প্রতি বর্গমিটারে ২ কেজি গোবর বা পচা আবর্জনা সার প্রয়োগ করতে হবে।
৪০০ বর্গমিটার বীজতলার জন্য ২ কেজি বা প্রতি বর্গমিটার বীজতলায় ৫০ গ্রাম বীজ বপন করতে হবে।

প্রতি গুছিতে মাত্র একটি বা দুটি চারা রোপণ করতে হবে।
প্রত্যেক মৌসুমের জন্য নতুন হাইব্রিড বীজের প্রয়োজন হয়।

হাইব্রিড ধানের জাত :- এসএল ৮এইচ, ব্রি-হাইব্রিড ধান ১,২,৩,হিরা,তেজ,এসিআই-২, সাথী, লাল তীর, মধুমতি, আলোড়ন, জাগরণ, জাগরণ-৩, রূপসী বাংলা-১, রূপালী, সচ্ছল ইত্যাদি।

বীজতলা তৈরি ও বীজ বপন :
উফশী ধানের বীজতলা তৈরি পদ্ধতি অবলম্বন করতে হবে। উপরন্ত বীজতলায় জৈবসার প্রয়োগ করা বাধ্যতামূলক। বীজতলার প্রতি বর্গমিটারে ২ কেজি পচা গোবর বা পচা আবর্জনা সার প্রয়োগ করতে হবে। তাছাড়া চারা সুস্থ ও সবল রাখতে জমি তৈরির সময় প্রতি বর্গমিটারে ৪ গ্রাম টিএসপি, ৭ গ্রাম এমপি এবং বীজ বোনার ১০ দিন পরে ৭ গ্রাম ইউরিয়া ও ১০ গ্রাম জিপসাম সার প্রয়োগ করা প্রয়োজন।

১মিটার চওড়া ও জমি অনুযায়ী সুবিধা মতো লম্বা করে বীজতলা তৈরি করতে হবে। দুটি বীজতলার মাঝে ২৫-৩০ সে. মিটার নালা রাখতে হবে।

৩০ সেমি. নালা ফাঁকা রাখা জায়গা থেকে ১৫ সেমি. গভীর করে মাটি তুলে দুই ধারের বীজতলায় দিতে হবে। এতে দুই বীজতলার মাঝের নালা দিয়ে সেচ বা পানি নিষ্কাশন ছাড়াও বিভিন্ন প্রকার পরিচর্যা করাও সহজ হবে। ১৫ নভেম্বর হতে ১৫ ডিসেম্বর পর্যন্ত সময়ে হাইব্রিড ধানের বীজ বপন করতে হবে।

জমি তৈরি :
উর্বর জমি, পানি নিষ্কাশনব্যবস্থা ও সেচের সুবিধা রয়েছে এমন জমি নির্বাচন করতে হবে। চারা রোপণের জন্য উত্তমরূপে চাষ ও মই দিয়ে মাটি কাদাময় করে নিতে হবে। শেষ চাষ ও মই দেয়ার সময় লক্ষ রাখতে হবে যেন জমিটা যথেষ্ট সমতল হয় এবং অনুমোদিত হারে সার ও প্রয়োগ করতে হবে।",
            'featured_image' => "4.jpg",
            'publish_status' => true,
            'blog_category_id' => 4,
            'blogger_id' => 1,
        ]);
    }
}
